app/Controllers/UserController.php

SELECT *
FROM `user`
WHERE `user_id` = '2023710578'
---
    function verify($id){
        $user = new UserModel();
        $data = $user->where('user_id', $id)->find();