app/Models/Notification.php

    function loadUserRequest($data){
        $sql = $this->db->table('notification_table')
                        ->selectCount('user_id')
                        ->from(`notification_table`)
                        ->where([
                            'user_id'=>$data,
                            'notification_status'=>'Unseen'

                        ]);
---
SELECT COUNT(*) AS `numrows`
FROM `notification_table`
WHERE `user_id` = '2023710578'
AND `notification_status` = 'Unseen'